Repository: batonius/Rfx
Catalog: *.po
Languages: ru

source: unexpected %s
ru: неожидаемый %s

source: expected %s
ru: ожидаемый %s

source: message %s
ru: сообщение %s

source: Lexer error: %s at %s.
ru: Ошибка лексера: %s в %s.

source: Syntax error: %s.
ru: Синтаксическая ошибка: %s.

source: Syntax error: variable %s has too many parts at %s.
ru: Синтаксичская ошибка: переменная %s в %s имеет слишком много частей.

source: Error: no such variable %s at %s.
ru: Ошибка: переменная %s в %s не существует.

source: Error: incorrect usage of operator %s at %s.
ru: Ошибка: неверное использование оператора %s в %s.

source: Error: variable %s at position %s already defined at %s.
ru: Ошибка: переменная %s в %s уже определена в %s.

source: Error: wrong type of initialization expression of variable %s at %s
ru: Ошибка: неверный тип инициализирующего выражения переменной %s в %s.

source: Error: usage variables in initialization exression prohibited; variable %s at %s.
ru: Ошибка: использование переменных в инициализирующих выражениях запрещено, переменная %s в %s.

source: Error: no such type %s at %s.
ru: Ошибка: тип %s не существует, в %s.

source: Error: no such thread %s at %s.
ru: Ошибка: поток %s в %s не существует.

source: Error: no such state %s in thread %s at %s.
ru: Ошибка: состояние %s в потоке %s в %s не существует.

source: Error: no such function %s at %s.
ru: Ошибка: функция %s в %s не существует.

source: Error: wrong types of arguments of function %s at %s.
ru: Ошибка: неверные типы агрументов функции %s в %s.

source: Error: wrong type of expression in assigment to %s at %s.
ru: Ошибка: неверный тип выражения в операции присваивания переменной %s в %s.

source: Error: Next statment outside of state clause at %s.
ru: Ошибка: оператор Next вне состояния в %s.

source: Error: wrong type of argument of return statment at %s.
ru: Ошибка: неверный тип аргумента оператора return в %s.

source: Error: not all executoin paths in function %s return value.
ru: Ошибка: не все пути выполнения функции %s возвращают значение.

source: Error: multiple definition of thread %s.
ru: Ошибка: множественное определение потока %s.

source: Error: multiple definition of state %s in thread %s.
ru: Ошибка: множественное определение состояния %s в потоке %s.

source: Error: statment argument type must be boolean at %s.
ru: Ошибка: аргумент оператора дожен быть логическим в %s.
